<a href="https://colab.research.google.com/github/ryegunde/Python_Tips/blob/main/Python_Tips_and_Tricks.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#The purpose of this notebook is to act as a quick resource for python

##List Comprehensions

say we want to double all the elements in a, Well with list comprehensions we no longer have to create a loop.

use format list[func for x in lst]

In [ ]:
a = [1, 3, 5, 7, 9]

#Traditional loop method
b = []
for x in a:
  b.append(x*2)
print(b)

#Now with list comprehensions
c = [x*2 for x in a]
print(c)

[2, 6, 10, 14, 18]
[2, 6, 10, 14, 18]

another example: lets create a list of elements 1-7 all squared

In [ ]:
a = [(x**2) for x in range(1, 7)]           #Note: The range goes from one until right bef
print(a)

another example: lets create a list of elements starting from 7 and going to 1 all squared

In [ ]:
a = [(x**2) for x in range(7, 0, -1)]       #Note: instead of going up by one each time, we want to go down by one so we use -1
print(a)

[49, 36, 25, 16, 9, 4, 1]

## Pivot Tables

We will be using Pandas for our pivot tables

We will start with a dataframe and reshape/transform it so that we have a meaningful table between two varaibles over a dataset

In [ ]:
import pandas as pd

In [ ]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [ ]:
drinks.head(10)

             country  ...      continent
0        Afghanistan  ...           Asia
1            Albania  ...         Europe
2            Algeria  ...         Africa
3            Andorra  ...         Europe
4             Angola  ...         Africa
5  Antigua & Barbuda  ...  North America
6          Argentina  ...  South America
7            Armenia  ...         Europe
8          Australia  ...        Oceania
9            Austria  ...         Europe

[10 rows x 6 columns]

In [ ]:
#Lets look at the avg beer_servings for the whole world
drinks.beer_servings.mean()

106.16062176165804

In [ ]:
#Now lets look at the avg beer_servings for each continent by using groupby(): Note use when anaylizing a categorical pandas data
drinks.groupby('continent').beer_servings.mean()
#think of it saying, for each continent, what is the mean beer_servings

continent
Africa            61.471698
Asia              37.045455
Europe           193.777778
North America    145.434783
Oceania           89.687500
South America    175.083333
Name: beer_servings, dtype: float64